adafruit/seesaw/seesaw_samd11/seesaw_samd11/include/SeesawConfig.h
#ifndef SEESAW_CONFIG_H
#define SEESAW_CONFIG_H

#if defined(BOARD_JOYFEATHER)
	#include "joyFeather.h"
#elif defined(BOARD_SAMD09BREAKOUT)
	#include "samd09Breakout.h"
#elif defined(BOARD_CHARLCD)
	#include "charLCD.h"
#else
	#include "debug.h"
#endif

#include "RegisterMap.h"
#include "PinMap.h"

#define VERSION_MAJOR 0x00
#define VERSION_MINOR 0x01
#define VERSION_SUB 0x01
#define CONFIG_VERSION (uint32_t)( ( (uint32_t)VERSION_MAJOR << 16 ) | ((uint32_t)VERSION_MINOR << 8) | (VERSION_SUB & 0xFF) )

//* ============== ADC =================== *//
#define CONFIG_ADC_INPUT_0_PIN 2

#define CONFIG_ADC_INPUT_1_PIN 3

#define CONFIG_ADC_INPUT_2_PIN 4

#define CONFIG_ADC_INPUT_3_PIN 5

//* ============== DAC =================== *//

//* ============== TIMER =================== *//

//TODO: fix timers for samd21
#if defined(__SAMD21G18A__)
	
	#define CONFIG_TIMER_PWM_OUT0_TC TC3
	#define CONFIG_TIMER_PWM_OUT0_WO 0
	#define CONFIG_TIMER_PWM_OUT0_PIN 4

	
	#define CONFIG_TIMER_PWM_OUT1_TC TC3
	#define CONFIG_TIMER_PWM_OUT1_WO 1
	#define CONFIG_TIMER_PWM_OUT1_PIN 5

	
	#define CONFIG_TIMER_PWM_OUT2_TC TC4
	#define CONFIG_TIMER_PWM_OUT2_WO 0
	#define CONFIG_TIMER_PWM_OUT2_PIN 6

	
	#define CONFIG_TIMER_PWM_OUT3_TC TC4
	#define CONFIG_TIMER_PWM_OUT3_WO 1
	#define CONFIG_TIMER_PWM_OUT3_PIN 7
#else
	#define CONFIG_TIMER_PWM_OUT0_TC TC1
	#define CONFIG_TIMER_PWM_OUT0_WO 0
	#define CONFIG_TIMER_PWM_OUT0_PIN 4

	#define CONFIG_TIMER_PWM_OUT1_TC TC1
	#define CONFIG_TIMER_PWM_OUT1_WO 1
	#define CONFIG_TIMER_PWM_OUT1_PIN 5

	#define CONFIG_TIMER_PWM_OUT2_TC TC2
	#define CONFIG_TIMER_PWM_OUT2_WO 0
	#define CONFIG_TIMER_PWM_OUT2_PIN 6

	#define CONFIG_TIMER_PWM_OUT3_TC TC2
	#define CONFIG_TIMER_PWM_OUT3_WO 1
	#define CONFIG_TIMER_PWM_OUT3_PIN 7
#endif

#if CONFIG_TIMER
	typedef struct _PWM
	{
		Tc*				tc ;
		uint8_t			wo ;
		uint8_t			pin;
	} _PWM ;

	static _PWM g_pwms[]=
	{
		{ CONFIG_TIMER_PWM_OUT0_TC, CONFIG_TIMER_PWM_OUT0_WO, CONFIG_TIMER_PWM_OUT0_PIN },
		{ CONFIG_TIMER_PWM_OUT1_TC, CONFIG_TIMER_PWM_OUT1_WO, CONFIG_TIMER_PWM_OUT1_PIN },
		{ CONFIG_TIMER_PWM_OUT2_TC, CONFIG_TIMER_PWM_OUT2_WO, CONFIG_TIMER_PWM_OUT2_PIN },
		{ CONFIG_TIMER_PWM_OUT3_TC, CONFIG_TIMER_PWM_OUT3_WO, CONFIG_TIMER_PWM_OUT3_PIN },
	};
#endif

//* ============== INTERRUPT =================== *//

//* ============== I2C SLAVE =================== *//

#if defined(__SAMD21G18A__)
	#define CONFIG_I2C_SLAVE_SERCOM SERCOM3
	#define CONFIG_I2C_SLAVE_HANDLER SERCOM3_Handler
	#define CONFIG_I2C_SLAVE_IRQn SERCOM3_IRQn
#else
	#define CONFIG_I2C_SLAVE_SERCOM SERCOM1
	#define CONFIG_I2C_SLAVE_HANDLER SERCOM1_Handler
	#define CONFIG_I2C_SLAVE_IRQn SERCOM1_IRQn
#endif

	#define CONFIG_I2C_SLAVE_PIN_SDA 22
	#define CONFIG_I2C_SLAVE_PIN_SCL 23

#define CONFIG_I2C_SLAVE_ADDR 0x49

//* ============== SERCOM =================== *//

#define CONFIG_SERCOM_UART_PIN_RX 11
#define CONfIG_SERCOM_UART_PIN_TX 10
#define CONFIG_SERCOM_UART_PAD_TX UART_TX_PAD_2
#define CONFIG_SERCOM_UART_PAD_RX SERCOM_RX_PAD_3

#define CONFIG_SERCOM_UART_BAUD_RATE 9600
#define CONFIG_SERCOM_UART_CHAR_SIZE UART_CHAR_SIZE_8_BITS

#define CONFIG_SERCOM_UART_PARITY SERCOM_NO_PARITY

#define CONFIG_SERCOM_UART_STOP_BIT SERCOM_STOP_BIT_1

//* ============== DAP =================== *//

	#define CONFIG_DAP_SWCLK 11
	#define CONFIG_DAP_SWDIO 10
	#define CONFIG_DAP_TDI 19
	#define CONFIG_DAP_TDO 20
	#define CONFIG_DAP_nTRST 21
	#define CONFIG_DAP_nRESET 14
	
//* =========== NEOPIXEL ================ *//


//* ============== GPIO ================= *//

#define CONFIG_GPIO_MASK ((0xFFFFFFFFul) ^ (( (1ul << PIN_USB_DM) | (1ul << PIN_USB_DP) | (1ul << PIN_ADDR_0) | (1ul << PIN_ADDR_1) | (1ul << PIN_ACTIVITY_LED) ) \
		| ((uint32_t)(CONFIG_ADC_INPUT_0 & CONFIG_ADC) << CONFIG_ADC_INPUT_0_PIN) \
		| ((uint32_t)(CONFIG_ADC_INPUT_1 & CONFIG_ADC) << CONFIG_ADC_INPUT_1_PIN) \
		| ((uint32_t)(CONFIG_ADC_INPUT_2 & CONFIG_ADC) << CONFIG_ADC_INPUT_2_PIN) \
		| ((uint32_t)(CONFIG_ADC_INPUT_3 & CONFIG_ADC) << CONFIG_ADC_INPUT_3_PIN) \
		| ((uint32_t)(CONFIG_TIMER & CONFIG_TIMER_PWM_OUT0) << CONFIG_TIMER_PWM_OUT0_PIN) \
		| ((uint32_t)(CONFIG_TIMER & CONFIG_TIMER_PWM_OUT1) << CONFIG_TIMER_PWM_OUT1_PIN) \
		| ((uint32_t)(CONFIG_TIMER & CONFIG_TIMER_PWM_OUT2) << CONFIG_TIMER_PWM_OUT2_PIN) \
		| ((uint32_t)(CONFIG_TIMER & CONFIG_TIMER_PWM_OUT3) << CONFIG_TIMER_PWM_OUT3_PIN) \
		| ((uint32_t)CONFIG_INTERRUPT << CONFIG_INTERRUPT_PIN) \
		| ((uint32_t)CONFIG_I2C_SLAVE << CONFIG_I2C_SLAVE_PIN_SCL) \
		| ((uint32_t)CONFIG_I2C_SLAVE << CONFIG_I2C_SLAVE_PIN_SDA) \
		| ((uint32_t)(CONFIG_SERCOM0 | CONFIG_SERCOM1 | CONFIG_SERCOM2 | CONFIG_SERCOM3 | CONFIG_SERCOM4 | CONFIG_SERCOM5) << CONFIG_SERCOM_UART_PIN_RX) \
		| ((uint32_t)(CONFIG_SERCOM0 | CONFIG_SERCOM1 | CONFIG_SERCOM2 | CONFIG_SERCOM3 | CONFIG_SERCOM4 | CONFIG_SERCOM5) << CONfIG_SERCOM_UART_PIN_TX))) \


#define CONFIG_NUM_AO (1 + CONFIG_ADC + CONFIG_DAC + CONFIG_TIMER + CONFIG_INTERRUPT + CONFIG_SERCOM0 + CONFIG_SERCOM1 + CONFIG_SERCOM2 + CONFIG_SERCOM3 + CONFIG_SERCOM4 + CONFIG_SERCOM5 + CONFIG_I2C_SLAVE + CONFIG_DAP + CONFIG_NEOPIXEL)

#define CONFIG_OPTIONS ( (0x03ul) | (CONFIG_DAC << SEESAW_DAC_BASE) \
			| ((uint32_t)CONFIG_ADC << SEESAW_ADC_BASE) \
			| ((uint32_t)CONFIG_TIMER << SEESAW_TIMER_BASE) \
			| ((uint32_t)CONFIG_INTERRUPT << SEESAW_INTERRUPT_BASE) \
			| ((uint32_t)CONFIG_SERCOM0 << SEESAW_SERCOM0_BASE) \
			| ((uint32_t)CONFIG_SERCOM1 << SEESAW_SERCOM1_BASE) \
			| ((uint32_t)CONFIG_SERCOM2 << SEESAW_SERCOM2_BASE) \
			| ((uint32_t)CONFIG_SERCOM3 << SEESAW_SERCOM3_BASE) \
			| ((uint32_t)CONFIG_SERCOM4 << SEESAW_SERCOM4_BASE) \
			| ((uint32_t)CONFIG_SERCOM5 << SEESAW_SERCOM5_BASE) \
			| ((uint32_t)CONFIG_DAP << SEESAW_DAP_BASE) \
			| ((uint32_t)CONFIG_NEOPIXEL << SEESAW_NEOPIXEL_BASE))

#endif